<a href="https://colab.research.google.com/github/anishadh137/PUS2020_AAdhikari/blob/master/PUS_Class2_demo.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [7]:
from google.colab import drive
import pandas as pd
drive.mount("/content/drive")

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [8]:
cd drive/Shared\ drives/PUS2020

/content/drive/Shared drives/PUS2020

In [9]:
ls

 classlogo.ipynb                     MapPLUTO+2008
 data/                               nyc_mappluto_20v5_shp.zip
'Example PUS2020 class quiz.gform'  'PUS2020 CoC and Github repo.gform'
 inclassquizzes/                     testDiffSheets.ipynb
 manhattan.zip                       wilmingtonskyline.png

In [13]:
df1 = pd.read_excel("data/Varnamesnlabels_m2ihip_R.xlsx")

In [14]:
df2 = pd.read_excel("data/Varnamesnlabels_m2ihip.xlsx")

In [15]:
df1.head()

          varname                           varlabel
0              id                                NaN
1     m2StartDate                         Start Date
2       m2EndDate                           End Date
3  m2RecordedDate                      Recorded Date
4           m2hid  Enter House ID Number here (1-8):

In [16]:
df2.head()

    varname                                           varlabel
0        id                                                NaN
1     m2hid                  Enter House ID Number here (1-8):
2     m2ooh                                                NaN
3     m2age  How old are you? Please enter your current age...
4  m2agecat                          Age, categorical variable

df1.tail()

In [18]:
df2.tail()

              varname                                           varlabel
214     m2severetotal  Addiction Severity Total Composite: Higher sco...
215          m2currod  In the past month, did you experience an overd...
216  m2currodfreq_str        Number of times you experienced an overdose
217     m2openend_str  Is there anything else you would like us to know?
218  m2employoth_flag     Participant specified other employment status.

In [19]:
df1.describe()

             varname                                        varlabel
count            222                                             220
unique           222                                             219
top     m2resilient3  Participant specified other employment status.
freq               1                                               2

In [20]:
df2.describe()

             varname                                        varlabel
count            219                                             217
unique           219                                             216
top     m2resilient3  Participant specified other employment status.
freq               1                                               2

In [23]:
merged = df1.merge(df2, on="varname", how='outer', indicator=True)

In [24]:
merged._merge

0           both
1      left_only
2      left_only
3      left_only
4           both
         ...
217         both
218         both
219         both
220         both
221         both
Name: _merge, Length: 222, dtype: category
Categories (3, object): [left_only, right_only, both]

This gives only the columns that are true to your *need*

In [26]:
merged[merged["_merge"] == "both"]

              varname  ... _merge
0                  id  ...   both
4               m2hid  ...   both
5               m2ooh  ...   both
6               m2age  ...   both
7            m2agecat  ...   both
..                ...  ...    ...
217     m2severetotal  ...   both
218          m2currod  ...   both
219  m2currodfreq_str  ...   both
220     m2openend_str  ...   both
221  m2employoth_flag  ...   both

[219 rows x 4 columns]

This gives clomun that is not true (~)

In [ ]:
merged[~(merged["_merge"] == "both")]

          varname     varlabel_x varlabel_y     _merge
1     m2StartDate     Start Date        NaN  left_only
2       m2EndDate       End Date        NaN  left_only
3  m2RecordedDate  Recorded Date        NaN  left_only

**Public Policy and Data Scicence**

1.   Data for GOOD
2.   Data Kind

1.   The Kinder Institute for Urban Research

1.   Metro21: Smart Cities Carnegie Mellon University 
2.   New Yoirk City Leader in Urban Informatics